Revit 2025 API
CeramicPatternType Enumeration
 The enumerated type representing the permitted values for the asset property "CeramicPattern" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum CeramicPatternType
Public Enumeration CeramicPatternType
public enum class CeramicPatternType
type CeramicPatternType
Members
Member name | Value | Description
None | 0
Custom | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace